<?php

return [
    'record' => [
        /**
         * 1用户主动应募
         *
         */
        'status_user' => [
            '1' => "応募済み",
            '2' => "書類要請中",
            '3' => "書類提出済",
            '4' => "書類提出拒否",

            '101' => "書類選考不合格",
            '102' => "面接中",
            '103' => "面接不合格",
            '104' => "内定済",
        ],
        'status_company' => [
            '1' => "略歴確認中",
            '2' => "略歴不合格",
            '3' => "書類要請中",
            '4' => "書類開示済",
            '5' => "書類開示検討中",

            '101' => "書類選考中",
            '102' => "不採用",
            '103' => "書類選考通過",
            '104' => "テスト",
            '105' => "テスト合格",
            '106' => "一次面接",
            '107' => "一次面接済み",
            '108' => "一次面接通過",
            '109' => "二次面接",
            '110' => "二次面接済み",
            '111' => "二次面接通過",
            '112' => "三次面接",
            '113' => "三次面接済み",
            '114' => "三次面接通過",
            '115' => "最終面接",
            '116' => "最終面接済み",
            '117' => "保留",
            '118' => "内定",
            '119' => "返答待ち",
            '120' => "辞退",
            '121' => "その他",
        ],
    ],
    'mail' => [
        'findjapanjob' => [
            'to' => "cao@hinabiz.com",
            'cc' => "findjapanjob@gmail.com",
        ],
        'global' => [
            'to' => "cao@hinabiz.com",
            'cc' => "tsuyu.cao@gmail.com",
        ],
        'about' => [
            'to' => "cao@hinabiz.com",
            'cc' => "tsuyu.cao@gmail.com",
        ],
        'agent' => [
            'to' => "cao@hinabiz.com",
            'cc' => "tsuyu.cao@gmail.com",
        ],
        'agent_request' => [
            'to' => "cao@hinabiz.com",
            'cc' => "tsuyu.cao@gmail.com",
        ],
    ],
    'job' => [
        'job_period_type' => [
            '1' => "掲載期間",
            '2' => "無期限",
            '3' => "掲載中止",
        ],
    ],

    'agent' => [
        'type' => [
            '1' => "外国人材がほしい",
            '2' => "求人情報がほしい",
        ],
        'agent_status' => [
            '1' => "登録済",
            '2' => "選考中",
            '3' => "内定",
            '4' => "請求済",
        ],
    ],

    'company' => [
        'company_type' => [
            '1' => "大手企業",
            '2' => "中小企業",
            '3' => "大手企業(上場企業)",
            '4' => "中小企業 (上場企業)",
        ],
        'member_total' => [
            '1' => "1〜10人",
            '2' => "10〜50人",
            '3' => "50〜200人",
            '4' => "200〜500人",
            '5' => "500〜1000人",
            '6' => "1000人以上",
        ],
    ],

    #
    'resume' => [
        'jp_level_2' => [
            '1' => 'N1',
            '2' => 'N2',
            '3' => 'N3',
            '4' => 'N4以下',
        ],
        'jp_level_str' => [
            '日本語ビジネスレベル' => ['N1', 'N2'],
            '日本語日常会話レベル' => ['N3'],
        ],
        'interview' => [
            '1' => 'はい',
            '2' => 'いいえ',
        ],
        'en_level' => [
            //'4' => '不問',
            '1' => 'ネイティブレベル',
            '2' => 'ビジネスレベル',
            '3' => '日常会話レベル',
        ],
        'other_level' => [
            '1' => 'ネイティブレベル',
            '2' => 'ビジネスレベル',
            '3' => '日常会話レベル',
        ],
        'jp_level' => [
            '1' => 'ネイティブレベル',
            '2' => 'ビジネスレベル',
            '3' => '日常会話レベル',
        ],
        'prefecture' => [
            '1' => '東京都',
            '2' => '大阪府',
            '24' => '愛知県',
        ],
        'country_city' => [
            '',
            '東京都',
            '大阪府',
            '北海道',
            '青森県',
            '岩手県',
            '宮城県',
            '秋田県',
            '山形県',
            '福島県',
            '茨城県',
            '栃木県',
            '群馬県',
            '埼玉県',
            '千葉県',
            '神奈川県',
            '新潟県',
            '富山県',
            '石川県',
            '福井県',
            '山梨県',
            '長野県',
            '岐阜県',
            '静岡県',
            '愛知県',
            '三重県',
            '滋賀県',
            '京都府',
            '兵庫県',
            '奈良県',
            '和歌山県',
            '鳥取県',
            '島根県',
            '岡山県',
            '広島県',
            '山口県',
            '徳島県',
            '香川県',
            '愛媛県',
            '高知県',
            '福岡県',
            '佐賀県',
            '長崎県',
            '熊本県',
            '大分県',
            '宮崎県',
            '鹿児島県',
            '沖縄県',
        ],
        'wage_type' => [
            '1' => '年俸',
            '2' => '月給',
            '3' => '時給',
        ],
        'wage_arr_1' => [
            '200' => '200万円',
            '250' => '250万円',
            '300' => '300万円',
            '350' => '350万円',
            '400' => '400万円',
            '450' => '450万円',
            '500' => '500万円',
            '550' => '550万円',
            '600' => '600万円',
            '650' => '650万円',
            '700' => '700万円',
            '750' => '750万円',
            '800' => '800万円',
            '850' => '850万円',
            '900' => '900万円',
            '950' => '950万円',
            '1000' => '1000万円',
            '9999' => '上限なし',
        ],
        'wage_arr_2' => [
            '15' => '15万円',
            '16' => '16万円',
            '17' => '17万円',
            '18' => '18万円',
            '19' => '19万円',
            '20' => '20万円',
            '21' => '21万円',
            '22' => '22万円',
            '23' => '23万円',
            '24' => '24万円',
            '25' => '25万円',
            '26' => '26万円',
            '27' => '27万円',
            '28' => '28万円',
            '29' => '29万円',
            '30' => '30万円',
            '35' => '35万円',
            '40' => '40万円',
            '45' => '45万円',
            '50' => '50万円',
            '55' => '55万円',
            '60' => '60万円',
            '65' => '65万円',
            '70' => '70万円',
            '75' => '75万円',
            '80' => '80万円',
            '9999' => '上限なし',
        ],
        'wage_arr_3' => [
            '700' => '700円',
            '800' => '800円',
            '900' => '900円',
            '1000' => '1000円',
            '1100' => '1100円',
            '1200' => '1200円',
            '1300' => '1300円',
            '1400' => '1400円',
            '1500' => '1500円',
            '1600' => '1600円',
            '1700' => '1700円',
            '1800' => '1800円',
            '1900' => '1900円',
            '2000' => '2000円',
            '9999' => '上限なし',
        ],
        'working_form' => [
            '',
            '正社員',
            '契約社員',
            'アルバイト'
        ],
        'target' => [
            '',
            '新卒',
            '経験者',
            '未経験者歓迎'
        ],
        'company_type' => [
            '',
            '大手企業',
            '中小企業',
            '大手企業(上場企業)',
            '中小企業 (上場企業)',
        ],
        'sex' => [
            '',
            '男',
            '女',
        ],
        'nationality' => [
            '',
            '中国',
            'インド',
            'ベトナム',
            '台湾',
            '韓国',
            'ネパール',
            'インドネシア',
            'ミャンマー',
            'フィリピン',
            '香港',
            'スリランカ',
            'マレーシア',
            'ロシア',
            'ウズベキスタン',
            'タイ',
            'バングラデシュ',
            'その他'
        ],
        'nationality_agent' => [
            '',
            '日本',
            '中国',
            'インド',
            'ベトナム',
            '台湾',
            '韓国',
            'ネパール',
            'インドネシア',
            'ミャンマー',
            'フィリピン',
            '香港',
            'スリランカ',
            'マレーシア',
            'ロシア',
            'ウズベキスタン',
            'タイ',
            'バングラデシュ',
            'その他'
        ],
        'address' => [
            '',
            '日本在住',
            '海外在住',
        ],

        'address2' => [
            '',
            '日本',
            '日本以外',
        ],

        'residence_in_japan_year' => [
            '',
            '0年',
            '1年',
            '2年',
            '3年',
            '4年',
            '5年',
            '6年',
            '7年',
            '8年',
            '9年',
            '10年以上'
        ],
        'residence_in_japan_month' => [
            '',
            '0ヶ月',
            '1ヶ月',
            '2ヶ月',
            '3ヶ月',
            '4ヶ月',
            '5ヶ月',
            '6ヶ月',
            '7ヶ月',
            '8ヶ月',
            '9ヶ月',
            '10ヶ月',
            '11ヶ月',
        ],

        'have_license' => [
            1 => '有',
            0 => '無',
        ],
        'is_experience' => [
            1 => '有',
            0 => '無',
        ],

        'license_names' => [
            '',
            '日本語(JLPT)',
            'TOEIC',
            'TOEFL',
            'IELTS',
            'その他'
        ],
        'license_jlpt' => [
            '',
            'N1',
            'N2',
            'N3',
            'N4以下'
        ],

        'it_skill_os' => [ //系统
            '',
            'Windows',
            'Linux/Unix',
            'MAC'
        ],
        'it_skill_office' => [ //办公软件
            '',
            'WORD',
            'EXCEL',
            'PowerPoint'
        ],
        'it_skill_graphic' => [ //图形软件
            '',
            'Photoshop',
            'Illustrator',
            'UG',
            'Pro/E',
            'SolidWorks',
            'CATIA',
            '3ds Max',
            'Maya',
            'Unity',
            'Unreal Engine',
            'その他',
        ],
        'it_skill_language' => [ //开发语言
            '',
            'JAVA',
            'PHP',
            'Python',
            'HTML/CSS',
            'JavaScript',
            'C',
            'C++',
            'C#',
            'iOS(Objective-C/Swift)',
            'Android(Java)',
            'Salesforce',
            'SAP',
            'R',
            'Go',
            'Scala',
            'Ruby',
            'Perl',
            'COBOL',
            'その他'
        ],
        'it_skill_db' => [ //数据库
            '', 'ORACLE','SQL Server','DB2','MySQL','MongoDB','PostgreSQL','Access','その他'
        ],
        'it_skill_framework' => [ //框架
            '', '.NET','Struts','Spring','JSF','Hibernate','CakePHP','Laravel','Zend','その他'
        ],

        'commuting_hours' => [ //通勤時間
            '', 0.5, 1, 1.5, 2
        ],
        'family_members_num' => [
            '', '0人','1人','2人','3人','4人','5人以上'
        ],

        'is_spouse' => [
            1 => '有',
            0 => '無',
        ],

        'is_spouse_support' => [
            1 => '有',
            0 => '無',
        ],
        'desired_place' => [
            '', '東京都', '大阪府', '日本全国'
        ],

        'employ_types' => [ //雇用形態
            '', '正社員', '契約社員', '派遣社員', 'アルバイト'
        ],
        'annual_income' => [ //年収
            '', '200万円以下', '200〜250万円', '251〜300万円', '301〜350万円', '351〜400万円', '401〜450万円', '451〜500万円', '501〜550万円', '551〜600万円', '601〜650万円', '651〜700万円', '701〜750万円', '851〜900万円', '951〜1000万円', '1000万円以上'
        ],

        'final_education' => [
            '',
            '大学院',
            '大学',
            '短期大学',
            '専門学校',
        ],

        'science_arts' => [
            '',
            '文系',
            '理系',
        ],

        'employment_status' => [
            '',
            '在学中',
            '在職中',
        ],

        'visa_type' => [
            '',
            '技術・人文知識・国際業務',
            '留学',
            '高度人材',
            'ワーキングホリデー',
            '家族滞在',
            '永住',
            'その他',
        ],

        'know_way' => [
            '',
            'Facebook',
            'Google検索',
            'WeChat公衆号',
            '友人',
            '学校'
        ],

        'it_skill' => [
            "",
            "JAVA",
            "PHP",
            "iOS(Objective-C、Swift)",
            "Android(Java)　",
            ".NET",
            "C",
            "C#",
            "C++",
            "COBOL",
            "MySQL",
            "MSSQL　",
            "ORACLE　",
            "DB2　",
            "CAD",
            "CAE",
            "JavaScript",
            "Scala",
            "Ruby",
            "Perl",
            "Python",
        ],

        'desired_fileds' => [
            "",
            "IT/通信",
            "メーカー(機械/電気)",
            "メーカー(素材/化学/食品/その他)",
            "総合商社",
            "専門商社(卸)",
            "医療関連",
            "金融",
            "建設/不動産",
            "コンサルティング/リサーチ／専門事務所",
            "人材サービス/アウトソーシング/コールセンター",
            "インターネット/広告/メディア",
            "小売",
            "外食",
            "運輸/物流",
            "エネルギー(電力/ガス/石油/新エネルギー)",
            "旅行/宿泊/レジャー",
            "警備/清掃",
            "理容/美容/エステ",
            "教育",
            "農林水産/鉱業",
            "公社/官公庁/学校",
            "冠婚葬祭",
        ],

        'desired_job_type' => [
            "",
            "総合職​",
            "営業職",
            "企画・管理",
            "事務・アシスタント",
            "販売・サービス職",
            "専門職（コンサルティングファーム・専門事務所・監査法人）",
            "金融系専門職",
            "技術職（SE・インフラエンジニア・Webエンジニア）",
            "技術職（機械・電気）",
            "技術職（組み込みソフトウェア）",
            "技術職・専門職（建設・建築・不動産・プラント・工場）",
            "技術職（化学・素材・化粧品・トイレタリー）",
            "技術職（食品・香料・飼料）",
            "医療系専門職",
            "クリエイター・クリエイティブ職",
        ],
    ],

    #性别
    'sex' => [
        '1' => '男',
        '2' => '女',
        '3' => '保密'
    ],

    //权限
    'found_role' => [
        '1' => '风险提示权限',
        '2' => '基金关系图权限',
        '3' => '公司关系图权限',
        '4' => '财务报表权限',
        '5' => '审计报告权限',
        '6' => '出资明细权限',
        '7' => '查看其它权限',
        '8' => '项目风险权限'
    ],

    //权限
    'found_type' => [
        '1' => '个人',
        '2' => '公司',
    ],

    //币种
    'found_currency' => [
        '1' => '人民币',
        '2' => '美元'
    ],

    //内容类型
    'content_type' => [
        '1' => '文件',
        '2' => '文本'
    ],

    //公司状态
    'project_state' => [
        '0' => '未上市',
        '1' => '上市',
        '2' => '倒闭',
        '3' => '退出'
    ],

    //底部内容类型
    'buttom_type' => [
        '1' => '基金',
        '2' => '政策法规',
        '3' => '税务',
    ],

    'state' => [
        '0' => '禁用',
        '1' => '公开',
    ],

    'upload' => [
        'photo' => [
            'attachment' => [
                'ext' => ['png', 'jpg', 'jpeg', 'bmp','gif'],
                'base' => public_path(),
                'size' => 2 * 1024 * 1024,
                'thumbnail' => array('h' => 384, 'w' => 512, 'type' => '1'),
                'url_path' => '/upload/',
            ],
        ],
        'resume' => [
            'attachment' => [
                'ext' => ['doc', 'pdf', 'docx'],
                'base' => public_path(),
                'size' => 2 * 1024 * 1024,
                'url_path' => '/upload/resume/',
            ],
            'attachment_1' => [
                'ext' => ['doc', 'pdf', 'docx'],
                'base' => public_path(),
                'size' => 2 * 1024 * 1024,
                'url_path' => '/upload/resume/',
            ],
        ],
        'adminFile' => [
            'attachment' => [
                'ext' => ['doc', 'pdf', 'docx','xls', 'xlsx','jpg', 'png'],
                'base' => public_path(),
                'size' => 10 * 1024 * 1024,
                'url_path' => '/upload/resume/',
            ],
        ],

        'projectFile' => [
            'attachment' => [
                'ext' => ['doc', 'docx'],
                'base' => public_path(),
                'size' => 10 * 1024 * 1024,
                'url_path' => '/upload/resume/',
            ],
        ],

        'video' => [
            'attachment' => [
                'ext' => ['webm', 'mp4', 'ogg', 'mov'],
                'base' => public_path(),
                'size' => 100 * 1024 * 1024,
                'url_path' => '/upload/',
            ],
        ],
        'news' => [
            'attachment' => [
                'ext' => ['png', 'jpg', 'jpeg', 'gif'],
                'base' => public_path(),
                'size' => 2 * 1024 * 1024,
                'thumbnail' => array('h' => 384, 'w' => 512, 'type' => '1'),
                'url_path' => '/upload/',
            ],
        ],
        'banner' => [
            'attachment' => [
                'ext' => ['png', 'jpg', 'jpeg', 'gif'],
                'base' => public_path(),
                'size' => 2 * 1024 * 1024,
                'thumbnail' => array('h' => 768, 'w' => 1024, 'type' => '1'),
                'url_path' => '/upload/',
            ]
        ],
        'shop' => [
            'attachment' => [
                'ext' => ['png', 'jpg', 'jpeg', 'gif'],
                'base' => public_path(),
                'size' => 2 * 1024 * 1024,
                'thumbnail' => array('h' => 300, 'w' => 300, 'type' => '1'),
                'url_path' => '/upload/',
            ]
        ],
        'goods' => [
            'attachment' => [
                'ext' => ['png', 'jpg', 'jpeg', 'gif'],
                'base' => public_path(),
                'size' => 2 * 1024 * 1024,
                'thumbnail' => array('h' => 150, 'w' => 200, 'type' => '1'),
                'url_path' => '/upload/',
                'pixel' => ['h' => 150, 'w' => 200], //上传图片转有效
            ]
        ],
        'shopShow' => [
            'attachment' => [
                'ext' => ['png', 'jpg', 'jpeg', 'gif', 'mp4'],
                'base' => public_path(),
                'size' => 50 * 1024 * 1024,
//                'thumbnail' => array('h' => 300, 'w' => 300, 'type' => '1'),
                'url_path' => '/upload/',
            ]
        ],
        'user' => [
            'attachment' => [
                'ext' => ['jpg', 'gif', 'png', 'jpeg'],
                'base' => public_path(),
                'size' => 10 * 1024 * 1024,
                'thumbnail' => array('h' => 200, 'w' => 200, 'type' => '1'),//type 为0按比例缩放，1按固定宽度缩放，2按固定高度缩放，3按固定宽高缩放
                'url_path' => '/upload/',
            ],
        ],
        'avatar' => [
            'attachment' => [
                'ext' => ['jpg', 'gif', 'png', 'jpeg'],
                'base' => public_path(),
                'size' => 2 * 1024 * 1024,
                'thumbnail' => array('h' => 200, 'w' => 200, 'type' => '1'),//type 为0按比例缩放，1按固定宽度缩放，2按固定高度缩放，3按固定宽高缩放
                'url_path' => '/upload/',
            ],
        ],
        'ad' => [
            'attachment' => [
                'ext' => ['jpg', 'gif', 'png', 'jpeg'],
                'base' => public_path(),
                'size' => 10 * 1024 * 1024,
                'thumbnail' => array('h' => 768, 'w' => 1280, 'type' => '1'),//type 为0按比例缩放，1按固定宽度缩放，2按固定高度缩放，3按固定宽高缩放
                'url_path' => '/upload/',
            ],
        ],
        'fileinput' => [
            'attachment' => [
                'ext' => ['jpg', 'gif', 'png', 'jpeg'],
                'base' => public_path(),
                'size' => 10 * 1024 * 1024,
                'thumbnail' => array('h' => 150, 'w' => 200, 'type' => '1'),//type 为0按比例缩放，1按固定宽度缩放，2按固定高度缩放，3按固定宽高缩放
                'url_path' => '/upload/',
                'pixel' => ['h' => 300, 'w' => 400], //上传图片转有效
            ],
        ],
    ],

    'alert_msg' => [
        'system' => [
            'error' => "未知のエラー。", //服务器数据库等发生的未知错误
        ],

        'experiences' => [
            'save_success' => "保存に成功しました。", //详细履历保存成功
            'save_failed' => "保存に失敗しました。", //详细履历保存失败

            'video_save_success' => "保存に成功しました。", //小视频保存成功
            'video_save_failed' => "保存に失敗しました。", //小视频保存失败

            'download_null' => "『履歴書・職務経歴書』を記入してからお試しください。", //下载pdf时还未做成履历书
            'download_error' => "PDFのダウンロードが失敗しました。暫くしてから再度お試しください。", //下载pdf失败
        ],

        'favorite' => [
            'favorite_success' => "気に入りに登録しました。", //收藏成功
            'favorite_cancel_success' => "気に入りから削除しました。", //取消收藏成功
        ],

        'JobRecord' => [
            'record_success' => "応募に成功しました。", //应募成功
            'memo_save_success' => "保存に成功しました。", //memo保存成功
            'status_save_success' => "送信に成功しました。", //应募时用户和企业对话消息发送成功

            'scout_success' => "スカウトに成功しました。", //scout成功
            'scout_overstep' => "1日スカウトできる人数の上限に達しました。", //企业超出每日scout数
        ],

        'job' => [
            'save_success' => "保存に成功しました。", //求人保存成功
            'save_failed' => "保存に失敗しました。", //求人保存失败

            'copy_success' => "コピーに成功しました。編集画面を開きますか？", //copy成功，是否要跳转copy求人的详细

            'delete_success' => "削除に成功しました。", //求人删除成功
            'delete_failed' => "削除に失敗しました。", //求人删除失败
        ],

        'account' => [
            'mail_send_success' => "パスワードリセットの手順を{mail}に送信しました。",  //找回密码时发送邮件成功
            'mail_required' => "用户信息不能为空",  //邮件输入为空
            'mail_regex' => "メールアドレスのフォーマットが正しくありません。",  //邮件输入格式错误
            'mail_not_exist' => "このメールアドレスが登録されていません。",  //找回密码时输入的邮件找不到对应的用户
            'mail_exist' => "このメールアドレスは既に登録済みです。",  //简单履历添加时 邮箱已存在
            'agent_resume_exist' => "この方は既に登録しました。ご不明点が有りましたら弊社担当までご連絡ください。",  //agent简单履历添加时 用户已存在

            'password_success' => "パスワードの変更に成功しました。",  //密码修改成功
            'password_required' => "请输入密码",  //修改密码时密码为空
            'password_regex' => "密码格式不正确",  //修改密码时密码格式错误6到12位应数字

            'login_error' => "账号不存在或密码错误",  //登录时密码错误
            'login_success' => "登录成功",  //登录成功

            'mail_success' => "メールアドレスの変更に成功しました。",  //个人资料邮箱修改成功

            'info_success' => "保存に成功しました。",  //个人资料保存成功

            'mail_agent_success' => "送信に成功しました。",  // agent咨询发送成功

            'user_not_exist' => "アカウントが登録されていません。",//修改邮件或密码时用户不存在
            'password_error' => "正しいパスワードをご入力ください。",//修改邮件或密码时密码不正确
            'mail_identical' => "異なるメールアドレスをご入力ください。",//修改邮件时邮件相同

        ],

        'web' => [
            'job_preview' => "このページを離れます。データを保存しましたか？",
            'job_preview_input' => "保存してからプレビューを行ってください。", //请保存后再预览
            'level_page' => 'このページを離れます。データを保存しましたか？', //还没保存，离开当前页面
            'status_invite' => "選択した項目の選考状況を「書類選考中」に変更しますか？",
            'status_invite_all' => "全項目の選考状況を「書類選考中」に変更しますか？",
            'status_invite_error' => "{id}の選考状況は変更できません。再度ご選択ください",
            'record_job_exist' => "応募済みです。管理画面を開きますか？",
            'scout_job_exist' => "本求人にスカウトされましたので、スカウト管理画面を開きますか？",

            //agent  内定企业名
            'input_company_name' => "内定会社名をご記入ください。",
            'agent_request_success' => "送信に成功しました。",

            'agent_account_code_save_success' => "保存に成功しました。",
            //agent 去完善资料
            'agent_account_info' => "エージェント会社情報を完備する。",
        ],
    ],

    //美元->人民币 汇率
    'currency_rate' => 7.081,
];
