<p>{{  $content['name'] }}様</p><br/>
<p>この度はご応募いただきありがとうございます。</p>
<p>以下の内容でメッセージお受けいたしました。</p><br/>
<p>仕事 ID：{{$content['account_code']}}</p>
<p>ポジション：{{ $content['position'] }}</p>
<p>雇用形態：{{  $content['working_form'] }}</p>
<p>勤務地：{{  $content['prefecture'] }}</p>
<p>お名前：{{  $content['name'] }}</p>
<p>メール：{{  $content['email'] }}</p>
<p>電話番号：{{  $content['cell_phone'] }}</p>
<p>---------------------------------------</p>
<p>後ほど、担当者よりご連絡をさせていただきます。</p>
<p>今しばらくお待ちくださいますようよろしくお願い申し上げます。</p>
<p>---------------------------------------</p>
<p>このメールはシステムより自動送信しております。</p>
<p>ご返信いただいてもお答えできませんのでご了承ください。</p>
<p>---------------------------------------</p>

<br/>
<p>ハイナビズ株式会社グローバル人材事業部</p>
<p>電話：03-6161-6202（平日9:00～18:00）</p>
<p>〒105-0004 東京都港区新橋5-12-11 天翔新橋5丁目ビル702</p>

<p><a href='https://www.findjapan.com'>https://www.findjapanjob.com</a></p>
<p>hr@findjapanjob.com</p>